app/controllers/merchants_controller.rb

  def make_payment
    a = Payment.first
---
SELECT  "payments".* FROM "payments"   ORDER BY "payments"."id" ASC LIMIT 1