app/controllers/payments_controller.rb

  def create
    @payment = Payment.new(payment_params)
    Rails.logger.info("#{@payment.attributes}")
    respond_to do |format|
      if @payment.save
        @payment.update_attributes(:merchant_id => Merchant.first.id, :status => "OK")
---
INSERT INTO "payments" ("amount", "created_at", "customer_id", "updated_at") VALUES (?, ?, ?, ?)  [["amount", 3543.0], ["created_at", "2015-02-25 21:12:59.833714"], ["customer_id", 1], ["updated_at", "2015-02-25 21:12:59.833714"]]
SELECT  "merchants".* FROM "merchants"   ORDER BY "merchants"."id" ASC LIMIT 1

    def set_payment
      @payment = Payment.find(params[:id])
---
SELECT  "payments".* FROM "payments"  WHERE "payments"."id" = ? LIMIT 1  [["id", 4]]